
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИспользоватьМеханизмОбменаВРеальномВремени 	= Константы.Б_ИспользоватьМеханизмОбменаВРеальномВремени.Получить();
	НастройкаОбменаДокументовВРеальномВремени 	= Константы.Б_НастройкаОбменаДокументовВРеальномВремени.Получить();
	ИспользоватьМеханизмПечатиЧеков 			= Константы.Б_ИспользоватьМеханизмПечатиЧеков.Получить();
	КаталогЛога 								= Константы.Б_ОбщийКаталогЛога.Получить();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
		
	ОбновитьОтображениеЭлементовФормы();

КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	СохранениеКонстант();
КонецПроцедуры

&НаСервере
Процедура СохранениеКонстант()
	
	Константы.Б_НастройкаОбменаДокументовВРеальномВремени.Установить(НастройкаОбменаДокументовВРеальномВремени);
	Константы.Б_ИспользоватьМеханизмПечатиЧеков.Установить(ИспользоватьМеханизмПечатиЧеков);
	Константы.Б_ИспользоватьМеханизмОбменаВРеальномВремени.Установить(ИспользоватьМеханизмОбменаВРеальномВремени);
	Константы.Б_ОбщийКаталогЛога.Установить(КаталогЛога);
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗадатьРасписаниеLongPulling(Команда)
	
	НашеРасписание = ПолучитьРасписаниеРегламетногоЗаданияОнлайнОбмена();
	                                                    
	Диалог = Новый ДиалогРасписанияРегламентногоЗадания(НашеРасписание);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗавершитьИзменятьРасписаниеLongPulling", ЭтотОбъект);
	
	Диалог.Показать(ОписаниеОповещения);
		
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьИзменятьРасписаниеLongPulling(РасписаниеЗадания, ДополнительныеПараметры) Экспорт
	
	Если РасписаниеЗадания = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НовоеРасписание = РасписаниеЗадания;
	
	ЗаписатьРегламетноеЗаданиеОнлайнОбмена(НовоеРасписание);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьРасписаниеРегламетногоЗаданияОнлайнОбмена()
	
	Возврат РегламентныеЗадания.НайтиПредопределенное(Метаданные.РегламентныеЗадания.Б_ЗаданиеОбменССайтомОнлайн).Расписание;
	
КонецФункции

&НаСервере
Процедура ЗаписатьРегламетноеЗаданиеОнлайнОбмена(Расписание)
	
	РегламентноеЗадание = РегламентныеЗадания.НайтиПредопределенное(Метаданные.РегламентныеЗадания.Б_ЗаданиеОбменССайтомОнлайн);
	РегламентноеЗадание.Расписание = Расписание;
	РегламентноеЗадание.Записать();
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиЭлементовФормы

&НаКлиенте
Процедура ОбновитьОтображениеЭлементовФормы()
	
	Если ИспользоватьМеханизмОбменаВРеальномВремени тогда
		
		Элементы.НастройкаОбменаДокументовВРеальномВремени.Доступность = Истина;
		
		Если ЗначениеЗаполнено(НастройкаОбменаДокументовВРеальномВремени) тогда
			Элементы.ЗадатьРасписаниеLongPulling.Доступность 		= Истина;	
		Иначе
			Элементы.ЗадатьРасписаниеLongPulling.Доступность 		= Ложь;	
		КонецЕсли;
		
	Иначе
		Элементы.НастройкаОбменаДокументовВРеальномВремени.Доступность 	= Ложь;	
		Элементы.ЗадатьРасписаниеLongPulling.Доступность 				= Ложь;	
		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура НастройкаОбменаДокументовВРеальномВремениПриИзменении(Элемент)
	
	СохранениеКонстант();
		
	ОбновитьОтображениеЭлементовФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьМеханизмПечатиЧековПриИзменении(Элемент)
	
	ОбновитьОтображениеЭлементовФормы();
	
	СохранениеКонстант();
	
	ОбновитьИнтерфейс();
	
КонецПроцедуры

&НаКлиенте
Процедура КаталогЛогаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
		
	СтандартнаяОбработка = Ложь;
	
	Если Не ПодключитьРасширениеРаботыСФайлами() Тогда
		Предупреждение(НСтр("ru = 'Для данной операции необходимо установить расширение работы с файлами!'"));
		Возврат;
	КонецЕсли;
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	
	Диалог.Заголовок = НСтр("ru = 'Укажите каталог, где будут лежать логи операций'");
	Диалог.Каталог   = КаталогЛога;
	
	Если Диалог.Выбрать() Тогда
		
		КаталогЛога = Диалог.Каталог;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьМеханизмОбменаВРеальномВремениПриИзменении(Элемент)
	
	Если НЕ ИспользоватьМеханизмОбменаВРеальномВремени тогда
		НастройкаОбменаДокументовВРеальномВремени = Неопределено;	
	КонецЕсли;
	
	ОбновитьОтображениеЭлементовФормы();
	
	СохранениеКонстант();
	
	ОбновитьИнтерфейс();

КонецПроцедуры

#КонецОбласти

