&НаКлиенте
Процедура ОткрытьФормуВыполненияОперации(ОписаниеОперации) Экспорт
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ОписаниеОперации", ОписаниеОперации);	
	ОтветФормы = Неопределено;
		
	//ОткрытьФорму("ОбщаяФорма.Б_ФормаВыполненияОперации", ПараметрыФормы, ,"ОкноСостояния",,,, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФормуВыполненияОперации() Экспорт
	Оповестить("Закрыть", ,"ОкноСостояния");
КонецПроцедуры

Функция ПолучитьПараметрыСоединения() Экспорт
   Структура = Новый Структура("Тип, Сервер, База, Файл, Строка"); 
    
   СтрокаСоединения = СтрокаСоединенияИнформационнойБазы(); 
   Структура.Строка = СтрокаСоединения; 
    
   СтрокаСоединения = СтрЗаменить(СтрокаСоединения, ";", Символы.ПС); 
    
   Стр1 = СтрПолучитьСтроку(СтрокаСоединения, 1); 
   Стр2 = СтрПолучитьСтроку(СтрокаСоединения, 2); 
    
   Если Лев(Стр1, 4) = "Srvr" Тогда 
       Структура.Тип = "Сервер"; 
       Структура.Сервер = Сред(Стр1, 7, СтрДлина(Стр1) - 7); 
       Структура.База = Сред(СтрПолучитьСтроку(СтрокаСоединения, 2), 6, СтрДлина(Стр2) - 6); 
   Иначе 
       Структура.Тип = "Файл"; 
       Структура.Файл = Сред(Стр1, 6, СтрДлина(Стр1) - 6); 
   КонецЕсли;     
    
   Возврат Структура; 
КонецФункции     

